# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [230]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [231]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    },
    index = ["a", "b", "c"]

)
#if you dont give index it will take default index values from 0.
# Standaard print
print(df)

# Vergelijk met
df

#to copy the dataframe in another dataframe

df_copy= df.copy()
display(df_copy)

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

In [232]:
# Data opslaan
df.to_csv('./pandas/persons.csv', header=True, index = False)

In [233]:
# Data inlezen
df_saved = pd.read_csv('./pandas/persons.csv')
display(df_saved)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [234]:
# De kolomnaam

df['Age']

a    22
b    35
c    58
Name: Age, dtype: int64

In [235]:
# Een kolom lezen
display(df['Age'])
display(df.Name)
age = "Age"
display(age)

a    22
b    35
c    58
Name: Age, dtype: int64

a     Braund, Mr. Owen Harris
b    Allen, Mr. William Henry
c    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

'Age'

In [236]:
# Een kolom verwijderen in twee manieren
# pop picks the column we want and keeps it seperately


#df.pop("Age")
#display(df)

#col = df.pop("Age")
#display(col)

In [237]:
df_copy =df.copy()
df_copy_copy=df_copy.drop("Age", axis =1)
display(df_copy)
display(df_copy_copy)

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

                       Name     Sex
a   Braund, Mr. Owen Harris    male
b  Allen, Mr. William Henry    male
c  Bonnell, Miss. Elizabeth  female

In [238]:
# Een rij lezen
df.iloc[0]
display(df.iloc[0])
#if there is a label use loc
df.loc['a']
display(df.loc['a'])
display(df.loc['a']['Name'])

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: a, dtype: object

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: a, dtype: object

'Braund, Mr. Owen Harris'

In [239]:
# Functie getRow() maken
# define fucntion getRow()

def getRow(dataframe, index):
    
    return dataframe.iloc[index]

getRow(df, 2)
    
#(or)

#df.getRow(2)

Name    Bonnell, Miss. Elizabeth
Age                           58
Sex                       female
Name: c, dtype: object

In [240]:
# Een rij toevoegen
df_copy = df.copy()

df_copy.loc['c'] = ["Kajal", 35, "Female"]
display(df_copy)


df_copy1 = pd.DataFrame({ "Name": "Rajesh", "Age": "43" ,"Sex": "Male"}, index = ["d"])
pd.concat([df_copy, df_copy1])

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c                     Kajal   35  Female

                       Name Age     Sex
a   Braund, Mr. Owen Harris  22    male
b  Allen, Mr. William Henry  35    male
c                     Kajal  35  Female
d                    Rajesh  43    Male

In [241]:
#to reistate the index,if you have removed from an existing file

df_copy_copy = df_copy.sort_index().reset_index(drop =False)

In [242]:
# Functie insertAt(row, index)
# ...

In [243]:
# Verkennen
# ...

In [250]:
# Filteren
df_copy_copy.query("Age > 30 and Sex == 'male'")

#zoek op mevrouw Bonnel

# (mes is the query which gives whole information about the object)

mes = df.query("Name == 'Bonnell, Miss. Elizabeth'")
mes["Sex"]

c    female
Name: Sex, dtype: object

In [252]:
df[df["Age"] > 30]

                       Name  Age     Sex
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

In [256]:
df[df["Name"].str.contains("B")]

Empty DataFrame
Columns: [Name, Age, Sex]
Index: []

In [ ]:
# Groeperen
# ...

In [ ]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...